#include <cstdlib>
#include <iostream>
#include <stdio.h>

// utf-16
//4c 6f 62 61 6e 6f 76 56 6c 61 64 69 6d 69 72 32 30 30 33 00
//c2 eb e0 e4 e8 ec e8 f0 cb ee e1 e0 ed ee e2 32 30 30 33 00
//cb ee e1 e0 ed ee e2 32 30 30 33 56 6c 61 64 69 6d 69 72 00

//utf-8
// 228 232 236 232 50 48 48 51 86 110 111 118 86 108 97 100
//247 204 193 196 201 205 201 210 236 207 194 193 206 207 215 
//236 207 194 193 206 207 215 97 100 105 109 105 114 50 48 48 

//win1251
//76 111 98 97 110 111 118 86 108 97 100 105 109 105 114 50 48 48 51
//194 235 224 228 232 236 232 203 238 225 224  237 238 226 50 48 48 51 
//194 235 224 228 232 236 232 50 48 48 51 86 108 97 100 105 109 105 114


int main()
{
	int number = 0x12345678;
	char lf[] = "LobanovVladimir2003";
	char rf[] = "¬ладимирЋобанов2003";
	char lr[] = "Ћобанов2003Vladimir";


	wchar_t Llp[] = L"LobanoVladimir2003";
	wchar_t Lrf[] = L"Ћобанов¬ладимир2003";
	wchar_t Llr[] = L"Ћобанов2003Vladimir";


	
	system("pause");
	return 0;
	
}